---
title: StairsType
classe: Autodesk.Revit.DB.Architecture.StairsType
namespace: Autodesk.Revit.DB.Architecture
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 18
---

# StairsType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `StairsConstructionMethod ConstructionMethod { get; }` | `stairsType.ConstructionMethod` | StairsConstructionMethod |
| `StairsEndConnectionType EndConnectionType { get; set; }` | `stairsType.EndConnectionType` | StairsEndConnectionType |
| `Boolean HasMiddleSupports { get; set; }` | `stairsType.HasMiddleSupports` | Boolean |
| `ElementId LandingType { get; set; }` | `stairsType.LandingType` | ElementId |
| `Double LeftLateralOffset { get; set; }` | `stairsType.LeftLateralOffset` | Double |
| `ElementId LeftSideSupportType { get; set; }` | `stairsType.LeftSideSupportType` | ElementId |
| `Double MaxRiserHeight { get; set; }` | `stairsType.MaxRiserHeight` | Double |
| `Int32 MiddleSupportsNumber { get; set; }` | `stairsType.MiddleSupportsNumber` | Int32 |
| `ElementId MiddleSupportType { get; set; }` | `stairsType.MiddleSupportType` | ElementId |
| `Double MinRunWidth { get; set; }` | `stairsType.MinRunWidth` | Double |
| `Double MinTreadDepth { get; set; }` | `stairsType.MinTreadDepth` | Double |
| `Double NotchExtension { get; set; }` | `stairsType.NotchExtension` | Double |
| `Double NotchHorizontalGap { get; set; }` | `stairsType.NotchHorizontalGap` | Double |
| `Double NotchThickness { get; set; }` | `stairsType.NotchThickness` | Double |
| `Double NotchVerticalGap { get; set; }` | `stairsType.NotchVerticalGap` | Double |
| `Double RightLateralOffset { get; set; }` | `stairsType.RightLateralOffset` | Double |
| `ElementId RightSideSupportType { get; set; }` | `stairsType.RightSideSupportType` | ElementId |
| `ElementId RunType { get; set; }` | `stairsType.RunType` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```